blog/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "great post"], ["created_at", "2015-03-19 09:37:41.119051"], ["post_id", 1], ["updated_at", "2015-03-19 09:37:41.119051"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)